app/Http/Controllers/Admin/PostsController.php

            $qr_store = DB::select('call ListParentStoreByTypeProcedure(?,?)',array('store', $posttype));
            $rs_store = json_decode(json_encode($qr_store), true);

            $post_types = PostType::all()->toArray();
---
select * from `post_types`

    public function create(Request $request)
    {
        $_iduser = Auth::id();
		$iddirect = $request->iddirect;
		if(!isset($iddirect)) $iddirect = 1;
        $idcrosstype = $request->idcrosstype;
        if(!isset($idcrosstype)) $idcrosstype = 0;
        $idparent = $request->idparent;
        if(!isset($idparent)) $idparent = 0;
        $idposttype = $request->idposttype;
        if(isset($idposttype)){
            $cattype = PostType::find($idposttype);
            $_namecattype = $cattype->nametype;
        }else{
            $_namecattype="post";
        }
        $parent_tilte = '';
        if($idparent > 0){
            $qr_parent_title = DB::select('call SelParentPhoneProcedure(?)', array($idparent));
            $rs_parent_title = json_decode(json_encode($qr_parent_title));
            if(isset($rs_parent_title)){
                foreach ($rs_parent_title as $row) {
                    $parent_tilte = $row->phone;
                }

            }
        }
        $cate_selected[0]['idcategory'] = 0;
        $str = '';
        $statustypes = status_type::all()->toArray();
        $posttypes = PostType::all()->toArray();
---
select * from `post_types`

    public function store(Request $request)
    {
        $posttypes = PostType::all()->toArray();
---
select * from `post_types`

				$_idstatusprocess = 7;
			}
            $product = new Products(['namepro'=> $_namepro,'sku_category'=>$_sku_category, 'sku_product'=>$_sku_product, 'slug'=> $_slug,'short_desc'=> $_short_desc,'description'=>$_description,'idsize'=>$_idsize,'idcolor'=>$_idcolor, 'id_post_type'=>$_id_post_type, 'idstatus_type'=>$_id_status_type, 'link'=>$_link, 'feature'=>$_feature, 'template'=>$_template, 'seo_desc'=>$seo_desc, 'keyword'=>$_keyword, 'idyoutube'=>$_idyoutube, 'post_author'=>$_iduser, 'idstatusprocess'=>$_idstatusprocess, 'iddirect'=>$_iddirect]);
            $product->save();
---
insert into `products` (`namepro`, `sku_category`, `sku_product`, `slug`, `short_desc`, `description`, `idsize`, `idcolor`, `id_post_type`, `idstatus_type`, `link`, `feature`, `template`, `seo_desc`, `keyword`, `idyoutube`, `post_author`, `idstatusprocess`, `iddirect`, `updated_at`, `created_at`) values ('p-1177', '', '', 'p-1177', '', '<p>3/9: 1 lit mật ong</p>', '', '', '4', '12', '', '', '', '', '', '', 51, '8', 2, '2021-09-03 15:33:54', '2021-09-03 15:33:54')

    public function edit(Request $request , $idproduct)
    {
        $_namecattype ="post";
        $_posttype ="post";
        $_idstore = 31;
		$_id_post_type = 3;
        $qr_cateselected = DB::select('call SelCateSelectedProcedure(?)',array($idproduct));
        $cate_selected = json_decode(json_encode($qr_cateselected), true);
        //$statustypes = status_type::all()->toArray();
        $posttypes = PostType::all()->toArray();
---
select * from `post_types`

    public function update(Request $request, $idproduct)
    {
            $posttypes = PostType::all()->toArray();
---
select * from `post_types`